# Assignment Operator กำหนดค่า คือ เครื่องหมาย =
# การทำงานของ = คือ เอาทางขวาไปใส่ทางซ้าย
# ยกเว้นแต่ว่า สิ่งที่อยู่ทางขวาทีการทำงานใดๆ ให้้ทำให้เสร็จแล้วเอาผลไปใส่ทางซ้าย
# ตัวแปร (variable) = ข้อมูล (data)/นิพจน์ (Expression)
# *** ตัวแปร (variable) คือ ฃื่อที่ Dev. ตั้งขึ้นมาเอาไว้เก็บข้อมูล ***
# *** การใช้งานตัวแปร คือ เอาข้อมูลไปใส่ในตัวแปร หรือ เอาข้อมูลที่มันเก็บอยู่มาใช้ ***

score = 20 
fullname = 'สมชาย'
salary = input('ป้อนเงินเดือน')
sum = 20 + 30
print('------------------')
num = 10
num += 10 #num = num + 10
num -= 10 #num = num - 10 
num *= 10 #num = num * 2
num %= 10 #num = num % 2
num //= 10 #num = num  // 2
print(num)
print('------------------')
