# สร้างโปรแกรมคำนวณผลคูณของตัวเลข 2 จำนวนที่รับทางแป้นพิมพ์ แล้วแสดงผลทางหน้าจอ
#ทั้งนี้โปรแกรมจะทำการคำนวณผลคูณจากตัวเลขที่รับทางแป้นพิมพ์ไปเรื่อยๆ จนกว่าผลคูณจะมากกว่า 5000 ถึงจะหยุดการทำงาน
# ****************************************
# **** ทายตัวเลขที่มีค่าอยู่ที่ 1 - 100 กันเถอะ ****
# ****************************************
# ป้อนตัวเลขที่ต้องการทาย : 25
# คุณทายผิดตัวเลขที่ป้อนน้อยไป
# *****************************************
# ป้อนตัวเลขที่ต้องการทาย : 85
# คุณทายผิดตัวเลขที่ป้อนมากไป
# *****************************************
# ป้อนตัวเลขที่ต้องการทาย : 80
# คุณทายผิดตัวเลขที่ป้อนมากไป
# *****************************************
# ป้อนตัวเลขที่ต้องการทาย : 59
# ยินดีด้วยคุณทายถูก
# *****************************************

print('**** ทายตัวเลขที่มีค่าอยู่ที่ 1 - 100 กันเถอะ ****')
while True:
    aa = int(input('ป้อนตัวเลขที่ต้องการทาย : '))
    if aa < 59 :
        print('คุณทายผิดตัวเลขที่ป้อนน้อยไป')
    elif aa > 59 :
        print('คุณทายผิดตัวเลขที่ป้อนมากไป')
    else :
        print('ยินดีด้วยคุณทายถูก')
        break